# Specify taps (additional repositories)
tap "FelixKratz/formulae"

# Install Homebrew formulas (command-line utilities and libraries)
brew "node"
brew "nvm"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "stow"
brew "fzf"
brew "bat"
brew "eza"
brew "yq"
brew "yazi"
brew "fd"
brew "zoxide"
brew "lua"
brew "luajit"
brew "luarocks"
brew "prettier"
brew "make"
brew "ripgrep"
brew "lazygit"
brew "tmux"
brew "neovim"
brew "starship"
brew "tree-sitter"
brew "tree"
